/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_digitlen.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vping <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/02/23 13:30:33 by vping             #+#    #+#             */
/*   Updated: 2021/02/23 13:30:35 by vping            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ft_digit_num: подсчет количества цифр в числе.
*/

int		ft_digitlen(long int n)
{
	int tmp;
	int tmp2;

	tmp2 = (int)n;
	tmp = 1;
	if (n < 0)
		++tmp;
	while ((tmp2 = tmp2 / 10))
		++tmp;
	return (tmp);
}
