/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vping <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/31 16:23:16 by vping             #+#    #+#             */
/*   Updated: 2020/10/31 16:25:56 by vping            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ft_isascii: возвращает ненулевое значение,
** если значение ch находится в пределах
** от 0 до 0x7F, в противном случае возвращается 0.
*/

int	ft_isascii(int c)
{
	return (c >= 0 && c <= 127);
}
