/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vping <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/31 16:30:29 by vping             #+#    #+#             */
/*   Updated: 2020/11/03 15:02:59 by vping            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ft_isalnum: возвращает ненулевое значение,
** если его аргумент является либо буквой
** алфавита (верхнего или нижнего регистра),
** либо цифрой. Если символ не является
** буквенно-цифровым, возвращается 0.
*/

int	ft_isalnum(int c)
{
	return (ft_isalpha(c) || ft_isdigit(c));
}
