/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vping <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/31 16:27:02 by vping             #+#    #+#             */
/*   Updated: 2020/10/31 16:29:16 by vping            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ft_isprint: возвращает ненулевое значение
** если c это печатаемый символ (0x20 - 0x7E).
*/

int	ft_isprint(int c)
{
	return (c >= 32 && c <= 126);
}
