/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vping <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/30 15:09:43 by vping             #+#    #+#             */
/*   Updated: 2020/10/30 16:34:40 by vping            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ft_memchr: Функция memchr ищет вхождение в массив
** cимвола, код которого задан аргументом c, сравнивая
** каждый байт массива определенный как unsigned char
** с кодом искомого символа. Если искомый символ найден,
** то возвращается адрес найденного символа и сравнение
** завершается. Если, после проверки n байтов,
** искомый символ не найден, то сравнение прекращается
** и функция возвращает NULL.
*/

void	*ft_memchr(const void *s, int c, size_t n)
{
	unsigned char *ptr;
	unsigned char sym;

	ptr = (unsigned char *)s;
	sym = (unsigned char)c;
	while (n--)
	{
		if (*ptr == sym)
			return ((void *)ptr);
		ptr++;
	}
	return (NULL);
}
