/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: vping <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/02 20:45:22 by vping             #+#    #+#             */
/*   Updated: 2020/11/03 15:04:34 by vping            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ft_putchar_fd: Выводит символ 'c'
** в указанный файл дескриптор.
*/

void	ft_putchar_fd(char c, int fd)
{
	write(fd, &c, 1);
}
